from functools import lru_cache

"""
------------------------------------------------------------------------
来源： addBoldTag
616. 给字符串添加加粗标签

itertools.groupby(zip(S, mask), lambda z: z[1])
zip:
itertools.groupby()
lambda
------------------------------------------------------------------------
"""

"""
------------------------------------------------------------------------
for ... else:
 else只有在for循环完全执行到最后一位退出后，才会被执行，
 一旦使用break，则不会被执行
------------------------------------------------------------------------
"""


def testFor():
    for i in range(10):
        if i == 5:
            break
    else:
        print("is end.")

    for i in range(10):
        pass
    else:
        print("is end.")


"""
------------------------------------------------------------------------
记忆化搜索：
from functools import lru_cache
使用该装饰器，递归参数需要确保可哈希
------------------------------------------------------------------------
"""

if __name__ == '__main__':
    testFor()
